Catalogs/ПользователиИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ПользователиИБ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВДомене</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLФотографии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПользователиИБ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСБуферомОбменаКлиентСервер.ДобавитьЭлементыФормыДляHTMLБуфера(ЭтотОбъект, Элементы);
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.СтраницаРежимаФормы.ТекущаяСтраница = Элементы.СтраницаРедактирования;
	Иначе
		Элементы.СтраницаРежимаФормы.ТекущаяСтраница = Элементы.СтраницаПросмотра;
	КонецЕсли;
	
	ПолучитьКартинкуПоURL();
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьКартинкуПоURL()
	
	Если ЗначениеЗаполнено(Объект.URLФотографии) Тогда 
		
		//Если СтрНачинаетсяС(Объект.URLФотографии, "https://") Тогда
		//	Сервер = СтрЗаменить(Объект.URLФотографии, "https://", "");
		//ИначеЕсли СтрНачинаетсяС(Объект.URLФотографии, "http://") Тогда
		//	Сервер = СтрЗаменить(Объект.URLФотографии, "http://", "");
		//КонецЕсли;
		//
		//ПутьСервер = СтрРазделить(Сервер, "/");
		//Соединение = Новый HTTPСоединение(ПутьСервер[0]);
		//Запрос = Новый HTTPЗапрос(Объект.URLФотографии);
		//Ответ = Соединение.Получить(Запрос);
		//ДвоичныеДанныеКартинки = Ответ.ПолучитьТелоКакДвоичныеДанные();
		//
		//
		//
		//Фотография = Новый Картинка(ДвоичныеДанныеКартинки);
		//
		//Фотография.Записать("C:\Temp1C\1.jpg");
		АдресФотографии = Объект.URLФотографии;
		//АдресФотографии = ПоместитьВоВременноеХранилище(Фотография, УникальныйИдентификатор); 
	Иначе
		АдресФотографии = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ПользовательБезФотографии, УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры // ПолучитьКартинкуПоURL()


&НаКлиенте
Процедура РедактироватьРеквизиты(Команда)
	
	Элементы.СтраницаРежимаФормы.ТекущаяСтраница = Элементы.СтраницаРедактирования;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЗначениеВБуфер(Значение)

	РаботаСБуферомОбменаКлиентСервер.СкопироватьВБуферОбмена(Значение, ЭтотОбъект["ПолеHTMLБуфера"]);

КонецПроцедуры // СкопироватьЗначениВБуфер()

&НаКлиенте
Процедура ПочтаПросмотрНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.Почта);
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПросмотрНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.Телефон);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяВДоменеПросмотрНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.ИмяВДомене);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОСПросмотрНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СкопироватьЗначениеВБуфер(Объект.ПользовательОС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
   

	
КонецПроцедуры
